_protected/frontend/controllers/ArticleController.php

SELECT COUNT(*) FROM `course` WHERE `category_id`=2
SELECT * FROM `course` WHERE `category_id`=2 ORDER BY `id` LIMIT 12
---
    public function actionIndex()
    {
        $query = Course::find()->where(['category_id' => 2 ]);


        $pagination = new Pagination([
            'defaultPageSize' => 12,
            'totalCount' => $query->count(),
        ]);

        $model = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `article` WHERE (`course_id`='36') AND (`status`=2)
SELECT * FROM `course` WHERE `id`='36'
---
    public function actionShow($id)
    {
        $model = Article::findAll([
            'course_id' => $id,
            'status' => 2,
        ]);

        $model2 = Course::findOne($id);

SELECT * FROM `article` WHERE (`id`='5') AND (`status`=2)
---
    public function actionShowdetail($id)
    {
        $model = Article::findOne([
            'id' => $id,
            'status' => 2,
        ]);