_protected/frontend/controllers/ForumAskController.php

    public function actionForum()
    {
        $query = Course::find()->where(['category_id' => 3 ]);
        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->count(),
        ]);

        $model = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `course` WHERE `category_id`=3
SELECT * FROM `course` WHERE `category_id`=3 ORDER BY `id` LIMIT 5

    public function actionShow($id)
    {

//        $model = ForumAsk::findAll([
//            'course_id' => $id,
//        ]);
        $query = ForumAsk::find()->where(['course_id' => $id]);


        $model2 = Course::findOne($id);
        $pagination = new Pagination([
            'defaultPageSize' => 8,
            'totalCount' => $query->count(),
        ]);
        $model = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT * FROM `course` WHERE `id`='48'
SELECT COUNT(*) FROM `forumAsk` WHERE `course_id`='48'
SELECT * FROM `forumAsk` WHERE `course_id`='48' ORDER BY `id` LIMIT 8

    public function actionShowdetail($id)
    {

        $model = ForumAsk::findOne([
            'id' => $id,

        ]);

        $modelsans = new ForumAns();
        $modelansC = ForumAns::find()->where([ 'forumAsk_id' => $id ])->count();
---
SELECT * FROM `forumAsk` WHERE `id`='10'
SELECT COUNT(*) FROM `forumAns` WHERE `forumAsk_id`='10'

    public function actionCreate($id)
    {
        $model = new ForumAsk();
        $model2 = new Tag();
        $model3 = Course::findOne($id);
---
SELECT * FROM `course` WHERE `id`='48'