_protected/frontend/controllers/VideosController.php

SELECT COUNT(*) FROM `course` WHERE `category_id`=1
SELECT * FROM `course` WHERE `category_id`=1 ORDER BY `id` LIMIT 12
---
    public function actionLesson() {
        $query = Course::find()->where(['category_id' => 1 ]);


        $pagination = new Pagination([
            'defaultPageSize' => 12,
            'totalCount' => $query->count(),
        ]);

        $model = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `course` WHERE `id`='34'
SELECT COUNT(*) FROM `videos` WHERE (`course_id`='34') AND (`videos_status_id`=2)
SELECT * FROM `videos` WHERE (`course_id`='34') AND (`videos_status_id`=2) ORDER BY `id` LIMIT 1
---
    public function actionShow($id) {

        $query = Videos::find()->where(['course_id' => $id, 'videos_status_id' => 2]);
//        $model = $query->orderBy('id')->all();
        $model2 = Course::findOne($id);
        $model3 = Search::find()->joinWith(['tag','videos'])->groupBy(['search.videos_id','tag.id'])->all();
        $pagination = new Pagination([
            'defaultPageSize' => 1,
            'totalCount' => $query->count(),
        ]);
        $model = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `course` WHERE `id`='34'
INSERT INTO `videos` (`user_id`, `title`, `content`, `url`, `course_id`, `videos_status_id`) VALUES (6, 'testttt3', '', 'https://www.youtube.com/watch?v=Jy35oa5oFoY', 34, 1)
SELECT * FROM `videos` WHERE `id`='18'
UPDATE `videos` SET `url`='Jy35oa5oFoY' WHERE (`id`=18) AND (`videos_status_id`=1)
INSERT INTO `search` (`tag_id`, `videos_id`) VALUES (1, 18)
---
    public function actionCreate($id)
    {
        $model = new Videos();
        $model->user_id = Yii::$app->user->id;
        $model2 = new Tag();
        $query = new Course();
        $model3 = Course::findOne($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

                $video_last_id = Yii::$app->db->getLastInsertID();
            $video_url = Videos::findOne(['id' => $video_last_id]);
            $video_url->url = StringHelper::byteSubstr($model->url,32);
            $video_url->save();

                if ($model2->load(Yii::$app->request->post())) {
                    $tag_title = StringHelper::explode($model2->title, ',');

                    foreach ($tag_title as $tag_title_value) {
                        $search = new Search();
                        $model_tmp = $model2->findOne(['title' => $tag_title_value]);
                        $search->tag_id = $model_tmp->id; // tag id from search by title
                        $search->videos_id = $video_last_id;
                        $search->save();

SELECT `videos`.* FROM `videos` LEFT JOIN `videos_status` ON `videos`.`videos_status_id` = `videos_status`.`id` WHERE `user_id`=6
---
    public function actionStatus()
    {
        $models = Videos::find()->joinWith(['videosStatus'])->
        where(['user_id' => Yii::$app->user->id])->all();

SELECT * FROM `videos` WHERE `id`='18'
---
    protected function findModel($id)
    {
        if (($model = Videos::findOne($id)) !== null) {