<?php
use yii\helpers\Html;

/* @var $this yii\web\View */
?>
<div class="about">

    <div class="site-about">
    <h2><?= Html::encode($this->title) ?></h2>

    <h4>&nbsp;&nbsp;&nbsp;&nbsp;www.inspiredev.com เป็นเว็บไซต์ที่ให้บริการด้านการศึกษาผ่านระบบออนไลน์โดยไม่มีการเสียค่าใช้จ่าย เว็บไซต์ของเราเป็นแหล่งเรียนรู้
    ที่รวบรวมวิดีโอ บทความ<br>และกระทู้ถาม-ตอบ เกี่ยวกับภาษาที่ใช้ในการเขียนโปรแกรม เช่น PHP CSS HTML เป็นต้น โดยเนื้อหาต่าง ๆ
    ที่รวบรวมนั้นมาจากผู้ที่มีความรู้ในด้านการเขียนโปรแกรม<br>ในภาษาประเภทต่าง ๆ โดยผู้เรียนสามารถเลือกเรียนรู้ได้ตามความต้องการ ทางคณะผู้จัดทำหวังเป็นอย่างยิ่งว่าเว็บไซต์ของเรา
    จะเป็นประโยชน์อย่างมากแก่ผู้ที่สนใจ</h4>

    <h3><br>วัตถุประสงค์</h3>
    <h4><li><p>เพื่อสร้างแหล่งเรียนรู้ผ่านเว็บไซต์ซึ่งมีการรวบรวมข้อมูลด้านการเขียนโปรแกรม</p></li></h4>
    <h4><li><p>เพื่อเป็นเว็บไซต์อีกหนึ่งทางเลือกให้สำหรับผู้ที่ต้องการศึกษาการเขียนโปรแกรม</p></li></h4>
    <h4><li><p>เพื่อให้ผู้ที่สนใจและผู้ที่ต้องการเริ่มเขียนโปรแกรมสามารถเข้าถึงข้อมูลได้ง่าย และใช้งานสะดวกรวดเร็วมากยิ่งขึ้น</p></li></h4>
<!--    <code>--><?//= __FILE__ ?><!--</code>-->
   </div>
</div>