_protected/common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => User::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`username`='bowling') AND (`status`=10)

    public static function userExists($username, $password, $scenario)
    {
        // if scenario is 'lwe', we need to check email, otherwise we check username
        $field = ($scenario === 'lwe') ? 'email' : 'username';

        if ($user = static::findOne([$field => $username]))
---
SELECT * FROM `user` WHERE `username` IS NULL